%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 版权声明：
%     本程序的详细中文注释请参考
%     黄小平，王岩，缪鹏程.粒子滤波原理及应用[M].电子工业出版社，2017.4
%     书中有原理介绍+例子+程序+中文注释
%     如果此程序有错误，请对提示修改
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 函数功能：实现随机重采样算法
% 输入参数：weight为原始数据对应的权重大小
% 输出参数：outIndex是根据weight对inIndex筛选和复制结果
function outIndex = randomR(weight)
L=length(weight)
 
outIndex=zeros(1,L)

 
u=unifrnd(0,1,1,L)
u=sort(u)
 
cdf=cumsum(weight)
 
i=1;
for j=1:L
  
    while (i<=L) & (u(i)<=cdf(j))
 
        outIndex(i)=j;
 
        i=i+1;
    end
end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%